In [1]:
import pandas as pd

# Convert a python dict to dataframe

In [2]:
people = {
    "first_name": ["John", "Tom", "Sarah"],
    "last_name": ["White", "Junior", "Li"],
    "email": ["jw@gmail.com", "tj@school.org", "sali@msn.info"]
}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

  first_name last_name          email
0       John     White   jw@gmail.com
1        Tom    Junior  tj@school.org
2      Sarah        Li  sali@msn.info

In [5]:
df["email"]

0     jw@gmail.com
1    tj@school.org
2    sali@msn.info
Name: email, dtype: object

The above example is a series object.

In [6]:
df.email

0     jw@gmail.com
1    tj@school.org
2    sali@msn.info
Name: email, dtype: object

In [7]:
print(type(df["email"]), type(df.email))

<class 'pandas.core.series.Series'> <class 'pandas.core.series.Series'>

Use brackets notation.

In [8]:
df[["first_name", "last_name"]]

  first_name last_name
0       John     White
1        Tom    Junior
2      Sarah        Li

# Using `loc` and `iloc`
`loc` and `iloc` are two functions in Pandas that are used to slice a data set in a Pandas DataFrame. `loc` stands for location and `iloc` stands for index location.

In [9]:
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [10]:
df.iloc[0]

first_name            John
last_name            White
email         jw@gmail.com
Name: 0, dtype: object

In [11]:
df.iloc[[0, 1]]

  first_name last_name          email
0       John     White   jw@gmail.com
1        Tom    Junior  tj@school.org

In [12]:
df.iloc[[0, 2]]

  first_name last_name          email
0       John     White   jw@gmail.com
2      Sarah        Li  sali@msn.info

In [20]:
df.iloc[[0, 2], [1, 2]]

  last_name          email
0     White   jw@gmail.com
2        Li  sali@msn.info

In [16]:
df.loc[2]

first_name            Sarah
last_name                Li
email         sali@msn.info
Name: 2, dtype: object

In [17]:
df.loc[[0, 2], "email"]

0     jw@gmail.com
2    sali@msn.info
Name: email, dtype: object

In [18]:
df.loc[[0], ["first_name", "last_name"]]

  first_name last_name
0       John     White

In [21]:
df.loc[1:2, "email"]

1    tj@school.org
2    sali@msn.info
Name: email, dtype: object

In [22]:
df.loc[:, "first_name":"last_name"]

  first_name last_name
0       John     White
1        Tom    Junior
2      Sarah        Li